#### ContentNode Members

---

|  |
| --- |
| ContentNode Class   Methods   Properties   See Also |

The  ContentNode  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Dispose | (Inherited from  RenderNode  .) |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Public method | GetAsset | Returns an an instance of an Asset object, which contains definitions of the content node. |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method | GetTransform | A transformation matrix associated with the node. |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from  RenderNode  .) |
| Public property | NodeName | A readable name of the output node. (Inherited from  RenderNode  .) |

# See Also

ContentNode Class

Autodesk.Revit.DB Namespace